# The JOIN operation

![rel](https://sqlzoo.net/w/images/c/ce/FootballERD.png)

## JOIN and UEFA EURO 2012

This tutorial introduces `JOIN` which allows you to use data from two or more tables. The tables contain all matches and goals from UEFA EURO 2012 Football Championship in Poland and Ukraine.

The data is available (mysql format) at <http://sqlzoo.net/euro2012.sql>

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1.
The first example shows the goal scored by a player with the last name 'Bender'. The `*` says to list all the columns in the table - a shorter way of saying `matchid, teamid, player, gtime`

**Modify it to show the matchid and player name for all goals scored by Germany. To identify German players, check for: `teamid = 'GER'`**

In [2]:
%%sql
SELECT matchid, player FROM goal 
  WHERE teamid = 'GER';

 * postgresql://postgres:***@localhost/sqlzoo
10 rows affected.

[(1008, 'Mario Gómez'),
 (1010, 'Mario Gómez'),
 (1010, 'Mario Gómez'),
 (1012, 'Lukas Podolski'),
 (1012, 'Lars Bender'),
 (1026, 'Philipp Lahm'),
 (1026, 'Sami Khedira'),
 (1026, 'Miroslav Klose'),
 (1026, 'Marco Reus'),
 (1030, 'Mesut Özil')]

## 2.

From the previous query you can see that Lars Bender's scored a goal in game 1012. Now we want to know what teams were playing in that match.

Notice in the that the column `matchid `in the `goal` table corresponds to the `id` column in the `game` table. We can look up information about game 1012 by finding that row in the `game` table.

**Show id, stadium, team1, team2 for just game 1012**

In [3]:
%%sql
SELECT id,stadium,team1,team2
  FROM game
    WHERE id=1012;

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[(1012, 'Arena Lviv', 'DEN', 'GER')]

## 3.
You can combine the two steps into a single query with a JOIN.

```sql
SELECT *
  FROM game JOIN goal ON (id=matchid)
```

The **FROM** clause says to merge data from the goal table with that from the game table. The **ON** says how to figure out which rows in **game** go with which rows in **goal** - the **matchid** from **goal** must match **id** from **game**. (If we wanted to be more clear/specific we could say
`ON (game.id=goal.matchid)`

The code below shows the player (from the goal) and stadium name (from the game table) for every goal scored.

**Modify it to show the player, teamid, stadium and mdate for every German goal.**

In [4]:
%%sql
SELECT player, teamid, stadium, mdate
  FROM game JOIN goal ON (id=matchid)
    WHERE goal.teamid = 'GER';

 * postgresql://postgres:***@localhost/sqlzoo
10 rows affected.

[('Mario Gómez', 'GER', 'Arena Lviv', '9 June 2012'),
 ('Mario Gómez', 'GER', 'Metalist Stadium', '13 June 2012'),
 ('Mario Gómez', 'GER', 'Metalist Stadium', '13 June 2012'),
 ('Lars Bender', 'GER', 'Arena Lviv', '17 June 2012'),
 ('Lukas Podolski', 'GER', 'Arena Lviv', '17 June 2012'),
 ('Marco Reus', 'GER', 'PGE Arena Gdansk', '22 June 2012'),
 ('Miroslav Klose', 'GER', 'PGE Arena Gdansk', '22 June 2012'),
 ('Sami Khedira', 'GER', 'PGE Arena Gdansk', '22 June 2012'),
 ('Philipp Lahm', 'GER', 'PGE Arena Gdansk', '22 June 2012'),
 ('Mesut Özil', 'GER', 'National Stadium, Warsaw', '28 June 2012')]

## 4.
Use the same `JOIN` as in the previous question.

**Show the team1, team2 and player for every goal scored by a player called Mario `player LIKE 'Mario%'`**

In [5]:
%%sql
SELECT team1, team2, player 
  FROM game JOIN goal ON (id=matchid)
    WHERE goal.player LIKE 'Mario%';

 * postgresql://postgres:***@localhost/sqlzoo
9 rows affected.

[('GER', 'POR', 'Mario Gómez'),
 ('NED', 'GER', 'Mario Gómez'),
 ('NED', 'GER', 'Mario Gómez'),
 ('IRL', 'CRO', 'Mario Mandžukic'),
 ('IRL', 'CRO', 'Mario Mandžukic'),
 ('ITA', 'CRO', 'Mario Mandžukic'),
 ('ITA', 'IRL', 'Mario Balotelli'),
 ('GER', 'ITA', 'Mario Balotelli'),
 ('GER', 'ITA', 'Mario Balotelli')]

## 5.

The table `eteam` gives details of every national team including the coach. You can `JOIN` `goal` to `eteam` using the phrase goal `JOIN eteam on teamid=id`

**Show `player, teamid, coach, gtime` for all goals scored in the first 10 minutes `gtime<=10`**

In [6]:
%%sql
SELECT player, teamid, coach, gtime
  FROM goal JOIN eteam ON (teamid=id)
    WHERE gtime<=10;

 * postgresql://postgres:***@localhost/sqlzoo
4 rows affected.

[('Václav Pilar', 'CZE', 'Michal Bílek', 6),
 ('Petr Jirácek', 'CZE', 'Michal Bílek', 3),
 ('Fernando Torres', 'ESP', 'Vicente del Bosque', 4),
 ('Mario Mandžukic', 'CRO', 'Slaven Bilic', 3)]

## 6.

To `JOIN` `game` with `eteam` you could use either
`game JOIN eteam ON (team1=eteam.id)` or `game JOIN eteam ON (team2=eteam.id)`

Notice that because `id` is a column name in both `game` and `eteam` you must specify `eteam.id` instead of just `id`

**List the the dates of the matches and the name of the team in which 'Fernando Santos' was the team1 coach.**

In [7]:
%%sql
SELECT mdate, teamname
  FROM game JOIN eteam ON (team1=eteam.id)
    WHERE eteam.coach = 'Fernando Santos';

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('12 June 2012', 'Greece'), ('16 June 2012', 'Greece')]

## 7.

**List the player for every goal scored in a game where the stadium was 'National Stadium, Warsaw'**

In [8]:
%%sql
SELECT player
  FROM goal JOIN game ON (matchid=id)
    WHERE stadium = 'National Stadium, Warsaw';

 * postgresql://postgres:***@localhost/sqlzoo
9 rows affected.

[('Robert Lewandowski',),
 ('Dimitris Salpingidis',),
 ('Alan Dzagoev',),
 ('Jakub Blaszczykowski',),
 ('Giorgos Karagounis',),
 ('Cristiano Ronaldo',),
 ('Mario Balotelli',),
 ('Mario Balotelli',),
 ('Mesut Özil',)]

## 8. More difficult questions

The example query shows all goals scored in the Germany-Greece quarterfinal.
**Instead show the name of all players who scored a goal against Germany.**

> __HINT__   
> Select goals scored only by non-German players in matches where GER was the id of either **team1** or **team2**.
> You can use `teamid!='GER'` to prevent listing German players.
> You can use `DISTINCT` to stop players being listed twice.

In [9]:
%%sql
SELECT DISTINCT player
  FROM game JOIN goal ON matchid = id 
    WHERE (team1='GER' OR team2='GER') AND goal.teamid <> 'GER';

 * postgresql://postgres:***@localhost/sqlzoo
5 rows affected.

[('Dimitris Salpingidis',),
 ('Georgios Samaras',),
 ('Mario Balotelli',),
 ('Michael Krohn-Dehli',),
 ('Robin van Persie',)]

## 9.
Show teamname and the total number of goals scored.

> __COUNT and GROUP BY__  
> You should COUNT(*) in the SELECT line and GROUP BY teamname

In [10]:
%%sql
SELECT teamname, COUNT(player) AS goals
  FROM eteam JOIN goal ON id=teamid
    GROUP BY teamname
    ORDER BY teamname;

 * postgresql://postgres:***@localhost/sqlzoo
16 rows affected.

[('Croatia', 4),
 ('Czech Republic', 4),
 ('Denmark', 4),
 ('England', 5),
 ('France', 3),
 ('Germany', 10),
 ('Greece', 5),
 ('Italy', 6),
 ('Netherlands', 2),
 ('Poland', 2),
 ('Portugal', 6),
 ('Republic of Ireland', 1),
 ('Russia', 5),
 ('Spain', 12),
 ('Sweden', 5),
 ('Ukraine', 2)]

## 10.

**Show the stadium and the number of goals scored in each stadium.**

In [11]:
%%sql
SELECT stadium, COUNT(player) AS goals
  FROM game JOIN goal ON id=matchid
    GROUP BY stadium;

 * postgresql://postgres:***@localhost/sqlzoo
8 rows affected.

[('Stadion Miejski (Wroclaw)', 9),
 ('Stadion Miejski (Poznan)', 8),
 ('PGE Arena Gdansk', 13),
 ('Donbass Arena', 7),
 ('Olimpiyskiy National Sports Complex', 14),
 ('Arena Lviv', 9),
 ('Metalist Stadium', 7),
 ('National Stadium, Warsaw', 9)]

## 11.
**For every match involving 'POL', show the matchid, date and the number of goals scored.**

In [12]:
%%sql
SELECT matchid, mdate, COUNT(player) AS goals
  FROM game JOIN goal ON matchid = id 
    WHERE (team1 = 'POL' OR team2 = 'POL')
    GROUP BY matchid, mdate;

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[(1001, '8 June 2012', 2),
 (1004, '12 June 2012', 2),
 (1005, '16 June 2012', 1)]

## 12.
**For every match where 'GER' scored, show matchid, match date and the number of goals scored by 'GER'**

In [13]:
%%sql
SELECT matchid, mdate, COUNT(player) AS goals 
  FROM game JOIN goal ON id=matchid
    WHERE teamid = 'GER'
    GROUP BY matchid, mdate;

 * postgresql://postgres:***@localhost/sqlzoo
5 rows affected.

[(1008, '9 June 2012', 1),
 (1010, '13 June 2012', 2),
 (1030, '28 June 2012', 1),
 (1026, '22 June 2012', 4),
 (1012, '17 June 2012', 2)]

## 13.
List every match with the goals scored by each team as shown. This will use "CASE WHEN" which has not been explained in any previous exercises.

  mdate | team1 | score1 | team2 | score2
--------|-------|--------|-------|----------
1 July 2012 | ESP | 4 | ITA | 0
10 June 2012 | ESP | 1 | ITA | 1
10 June 2012 | IRL | 1 | CRO | 3
... | ... | ... | ... | ... | ...

Notice in the query given every goal is listed. If it was a team1 goal then a 1 appears in score1, otherwise there is a 0. You could SUM this column to get a count of the goals scored by team1. **Sort your result by mdate, matchid, team1 and team2.**

In [14]:
%%sql
SELECT mdate, team1, SUM(CASE WHEN teamid=team1 THEN 1 ELSE 0 END) AS score1, team2,
  SUM(CASE WHEN teamid=team2 THEN 1 ELSE 0 END) AS score2
    FROM game LEFT JOIN goal ON matchid = id
    GROUP BY mdate, team1, team2, matchid
    ORDER BY mdate, matchid, team1, team2;

 * postgresql://postgres:***@localhost/sqlzoo
31 rows affected.

[('1 July 2012', 'ESP', 4, 'ITA', 0),
 ('10 June 2012', 'ESP', 1, 'ITA', 1),
 ('10 June 2012', 'IRL', 1, 'CRO', 3),
 ('11 June 2012', 'FRA', 1, 'ENG', 1),
 ('11 June 2012', 'UKR', 2, 'SWE', 1),
 ('12 June 2012', 'GRE', 1, 'CZE', 2),
 ('12 June 2012', 'POL', 1, 'RUS', 1),
 ('13 June 2012', 'DEN', 2, 'POR', 3),
 ('13 June 2012', 'NED', 1, 'GER', 2),
 ('14 June 2012', 'ITA', 1, 'CRO', 1),
 ('14 June 2012', 'ESP', 4, 'IRL', 0),
 ('15 June 2012', 'UKR', 0, 'FRA', 2),
 ('15 June 2012', 'SWE', 2, 'ENG', 3),
 ('16 June 2012', 'CZE', 1, 'POL', 0),
 ('16 June 2012', 'GRE', 1, 'RUS', 0),
 ('17 June 2012', 'POR', 2, 'NED', 1),
 ('17 June 2012', 'DEN', 1, 'GER', 2),
 ('18 June 2012', 'CRO', 0, 'ESP', 1),
 ('18 June 2012', 'ITA', 2, 'IRL', 0),
 ('19 June 2012', 'ENG', 1, 'UKR', 0),
 ('19 June 2012', 'SWE', 2, 'FRA', 0),
 ('21 June 2012', 'CZE', 0, 'POR', 1),
 ('22 June 2012', 'GER', 4, 'GRE', 2),
 ('23 June 2012', 'ESP', 2, 'FRA', 0),
 ('24 June 2012', 'ENG', 0, 'ITA', 0),
 ('27 June 2012', 'POR', 0, 'ESP', 0),
 ('28 June 2012', 'GER', 1, 'ITA', 2),
 ('8 June 2012', 'POL', 1, 'GRE', 1),
 ('8 June 2012', 'RUS', 4, 'CZE', 1),
 ('9 June 2012', 'NED', 0, 'DEN', 1),
 ('9 June 2012', 'GER', 1, 'POR', 0)]